;该文件是unicode文件,注意不要删除了
;view_数字,视图,数字是视图编码,修改配置时,数字不能改
;func_数字,功能,数字是功能编码,修改配置时,数字不能改
;name_数字,功能名称,数字和func对应
;CanModify_数字,是否可以编辑,默认为1,可编辑,0为不可编辑


[view_1001]
;通用
view_name = 下单通用热键
name_1000 = 选择帐号
func_1000 = Ctrl+A
name_1001 = 选择商品	
func_1001 = Ctrl+S
name_1002 = 定位下单区域	
CanModify_1002 = 0
func_1002 = Esc
name_1003 = 向左移动选中单元格
CanModify_1003 = 0	
func_1003 = ←
name_1004 = 向右移动选中单元格
CanModify_1004 = 0
func_1004 = →
name_1005 = 向上移动选中单元格	 
CanModify_1005 = 0
func_1005 = ↑
name_1006 = 向下移动选中单元格	
CanModify_1006 = 0
func_1006 = ↓
name_1007 = 下单确定	
CanModify_1007 = 0
func_1007 = Enter
name_1008 = 0
func_1008 = Ctrl+0
name_1009 = 1
func_1009 = Ctrl+1
name_1010 = 2
func_1010 = Ctrl+2
name_1011 = 3
func_1011 = Ctrl+3
name_1012 = 4
func_1012 = Ctrl+4
name_1013 = 5
func_1013 = Ctrl+5
name_1014 = 6
func_1014 = Ctrl+6
name_1015 = 7
func_1015 = Ctrl+7
name_1016 = 8
func_1016 = Ctrl+8
name_1017 = 9
func_1017 = Ctrl+9

[view_1000]
;view_100,即主窗口
view_name = 界面控制热建
;F11不能修改,写死在程序里的,启动快捷键功能
name_100 = 启动快捷键
CanModify_100 = 0
func_100 = F11

name_101 = 关闭快捷键
func_101 = F12

name_102 = 关闭当前视图
func_102 = Ctrl+Q

name_103 = 窗口向后循环切换;
func_103 = Alt +Q

name_104 = 窗口向前循环切换;
func_104 = Shift +Alt+Q

name_105 = 开启闪电下单	
func_105 = Ctrl+W

name_106 = 开启序列期权手动下单	
func_106 = Ctrl+E

name_107 = 开启合成期货下单	
func_107 = Ctrl+R

name_108 = 开启价差下单	
func_108 = Ctrl+T

name_109 = 开启合成价差	
func_109 = Ctrl+Y

name_110 = 闪电下单窗口向前循环切换 	
func_110 = Alt+ W

name_111 = 闪电下单窗口向后循环切换	
func_111 = Shift+Alt+W

name_112 = 序列期权手动下单向前循环切换	
func_112 = Alt+ E

name_113 = 序列期权手动下单向后循环切换	
func_113 = Shift+Alt+E

name_114 = 合成期货向前循环切换	
func_114 = Alt+ R

name_115 = 合成期货向后循环切换	
func_115 = Shift+Alt+R

name_116 = 价差下单向前循环切换	
func_116 = Alt+ T

name_117 = 价差下单向后循环切换	
func_117 = Shift+Alt+T

name_118 = 合成价差向前循环切换	
func_118 = Alt+ Y

name_119 = 合成价差向后循环切换	
func_119 = Shift+Alt+Y

[view_4]
;view_32774,即闪电下单窗口
view_name = 闪电下单热建

name_2000 = 买单全部撤单
func_2000 = Alt+C

name_2001 = 卖单全部撤
func_2001 = Alt+X

name_2002 = 全部撤单
func_2002 = Alt+Z

name_2003 = 市价买
CanModify_2003 = 0
func_2003 = Alt+←

name_2004 = 市价卖
CanModify_2004 = 0
func_2004 = Alt+→